Data Selection in Series

Series as dictionary

In [1]:
import pandas as pd
data = pd.Series([0.25,0.5,0.75,1.0], index = ['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [2]:
data['b']

0.5

In [3]:
'a' in data

True

In [4]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [6]:
data['e'] = 1.25

In [7]:
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

Series as one-dimensional array

In [8]:
#slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [9]:
#slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [11]:
#masking
data[(data>0.3)&(data<0.8)]

b    0.50
c    0.75
dtype: float64

In [12]:
#fancy indexing
data[['a','e']]

a    0.25
e    1.25
dtype: float64

Indexers: loc, iloc, and ix

In [13]:
data = pd.Series(['a','b','c'], index = [1,3,5])
data

1    a
3    b
5    c
dtype: object

In [14]:
#explicit index when indexing
data[1]

'a'

In [15]:
#implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

the loc attribute allows indexing and slicing that always references the explicit index

In [16]:
data.loc[1]

'a'

In [17]:
data.loc[1:3]

1    a
3    b
dtype: object

The iloc attribute allows indexing and slicing that always references the implicit Python-style index

In [18]:
data.iloc[1]

'b'

In [22]:
data.iloc[1:3]

3    b
5    c
dtype: object

Data Selection in DataFrame

DataFrame as a dictionary

In [23]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})

data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [24]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [25]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [26]:
data.area is data['area']

True

In [27]:
data.pop

<bound method DataFrame.pop of               area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135>

In [28]:
data['pop']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
Name: pop, dtype: int64

In [29]:
data.pop is data['pop']

False

In [30]:
data['density'] = data['pop']/data['area']

In [31]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

DataFrame as two-dimensional array

In [32]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [35]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [36]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [37]:
data.iloc[:3,:2] #using column and row index numbers (from first to third row and first 2 columns)

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [38]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [41]:
data.loc[:'New York',:'density'] 
#Using names of indexes (city names as rows and area, pop, and density as columns)

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746

In [44]:
data.ix[:3, :'pop'] #not used any more (deprecated), use loc and iloc

AttributeError: 'DataFrame' object has no attribute 'ix'

In [45]:
data.loc[data.density>100, ['pop', 'density']] #masking and fancy indexing

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [47]:
data.iloc[0,2] = 90

In [48]:
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

To build up your fluency in Pandas data manipulation, I suggest spending some time with a 
simple DataFrame and exploring the types of indexing, slicing, masking, and fancy indexing that 
are allowed by these various indexing approaches

In [49]:
data.loc['Florida':,]

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [50]:
data.iloc[3:,]

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [51]:
data[data.density>100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121